/*
ENGLISH LANGUAGE FILE
*/

"VNC Connection Settings" = "VNC Connection Settings";
"VNC Template Settings" = "VNC Template Settings";
"VNC Default Settings" = "VNC Default Settings";
"Advanced" = "Advanced";

"With a VNC connection you can connect to remote computers supporting VNC or Apple Remote Desktop/Screen Sharing (standard port is 5900)." = "With a VNC connection you can connect to remote computers supporting VNC or Apple Remote Desktop/Screen Sharing (standard port is 5900).";
"Port/Display:" = "Port/Display:";
"The \"Display Name\" must not be empty." = "The \"Display Name\" must not be empty.";
"The \"Computer Name\" must not be empty." = "The \"Computer Name\" must not be empty.";

"Debug Logging is enabled in the VNC plugin settings. Please note that this can severely impact performance and should only be used for diagnosing issues. Do you want to continue with Debug Logging or do you want to disable it?" = "Debug Logging is enabled in the VNC plugin settings. Please note that this can severely impact performance and should only be used for diagnosing issues. Do you want to continue with Debug Logging or do you want to disable it?";
"Continue with Debug Logging" = "Continue with Debug Logging";
"Disable Debug Logging and Continue" = "Disable Debug Logging and Continue";

"Display Options" = "Display Options";
"Configure display settings, like the color depth and scaling, for this VNC connection." = "Configure display settings, like the color depth and scaling, for this VNC connection.";
"Scaling" = "Scaling";
"Enable Scaling" = "Enable Scaling";
"Colors" = "Colors";
"256 Colors (8 bit)" = "256 Colors (8 bit)";
"High Color (16 bit)" = "High Color (16 bit)";
"True Color (24 bit)" = "True Color (24 bit)";

"Use this page to change advanced VNC settings like shared connections and clipboard redirection." = "Use this page to change advanced VNC settings like shared connections and clipboard redirection.";
"Shared Connection" = "Shared Connection";
"Clipboard Redirection" = "Clipboard Redirection";

"Input" = "Input";
"Input Mode" = "Input Mode";
"Configure input settings, like keyboard behaviour, for this VNC connection." = "Configure input settings, like keyboard behaviour, for this VNC connection.";
"Keyboard Input" = "Keyboard Input";
"None (Observe Mode)" = "None (Observe Mode)";
"Forward keyboard shortcuts only if not in use locally" = "Forward keyboard shortcuts only if not in use locally";
"Forward keyboard shortcuts even if in use locally" = "Forward keyboard shortcuts even if in use locally";
"Forward all keyboard shortcuts and hotkeys" = "Forward all keyboard shortcuts and hotkeys";
"When '{0}' is enabled, Royal TSX requires 'Accessibility' permissions. Click the button below to open the 'Security & Privacy' pane of System Preferences, then activate Royal TSX in the 'Accessibility' section." = "When '{0}' is enabled, Royal TSX requires 'Accessibility' permissions. Click the button below to open the 'Security & Privacy' pane of System Preferences, then activate Royal TSX in the 'Accessibility' section.";
"When '{0}' is enabled, Royal TSX requires 'Accessibility' permissions. Click the button below to open the 'Privacy & Security' pane of System Settings, then activate Royal TSX in the 'Accessibility' section." = "When '{0}' is enabled, Royal TSX requires 'Accessibility' permissions. Click the button below to open the 'Privacy & Security' pane of System Settings, then activate Royal TSX in the 'Accessibility' section.";
